package jp.co.shoeisha.javarecipe.chapter02.recipe014;

public class CalculateSample {
	
	public static void main(String[] args) {
		/////////////////////////////////////////////////////////////////////////////
		// 異なる型同士の演算
		/////////////////////////////////////////////////////////////////////////////
		{
			// intとlongの計算結果はlongになる
			long a = 1 + 2L;
			System.out.println(a);
			
			// intとdoubleの計算結果はdoubleになる
			double b = 10 * 1.1d;
			System.out.println(b);
		}
		/////////////////////////////////////////////////////////////////////////////
		// インクリメント演算子・デクリメント演算子
		/////////////////////////////////////////////////////////////////////////////
		{
			int a = 1;
			
			// aの値を1増やす（a = a + 1 と同じ）
			a++; // => 2
			System.out.println(a);
			
			// bにaの値を代入した後、aの値を1増やす
			int b = a++; // => 2
			System.out.println(b);
			
			// aの値を1増やした後、cにaの値を代入する
			int c = ++a; // => 4
			System.out.println(c);
		}
		/////////////////////////////////////////////////////////////////////////////
		// 再帰代入演算子を使う
		/////////////////////////////////////////////////////////////////////////////
		{
			int a = 1;
			
			// aの値を10増やす（a = a + 10と同じ）
			a += 10;
			System.out.println(a);
			
			// aの値を5減らす（a = a - 5と同じ）
			a -= 5;
			System.out.println(a);
		}
	}
	
}
