// ----------------------------
// 안전한 난수
// crypto.getRandomValues(형붙인 배열); // 리턴:난수배열
// ----------------------------
//랜덤정수(부호없는16비트)가 10개들어간 배열을 생성
const randomArr = crypto.getRandomValues(new Uint16Array(10));
console.log(randomArr);
// Uint16Array(10) [ 30106, 64439, 30547, 1975, 9450, 62468, 27533, 27756, 63786, 36283 ]
// 배열을 이어 난수를 생성
const random16 = randomArr.join('');
console.log(random16);
// 301066443930547197594506246827533277566378636283
// ----------------------------
// 부호없는 32비트 난수생성
const random32 = crypto.getRandomValues(new Uint32Array(10)).join('');
console.log(random32);
// 382979343515709866573468246670218395933328989172757469039542220903590269873746935950855881383786406
// ----------------------------
// ----------------------------
// ----------------------------
// ----------------------------


