// ----------------------------
// 함수의 인수에 초기값 설정
// 1. function myFunc(인수1, 인수2=초기값2, 인수3=초기값3){}
// 2. (인수1, 인수2=초기값2, 인수3=초기값3) => {}
// 초기값이 설정된 인수를 생략가능
// ----------------------------
function myFunc1(price, tax = 0.08){
    const result = price + price * tax;
    return result;
}
console.log(myFunc1(100));       // 108
console.log(myFunc1(100, 0.02)); // 102
// ----------------------------
// 함수에 임의의 개수의 인수를 건넴
// "...인수" 残余引数（rest parameters）
// 건네진 인수는 배열로 저장됨
// 1. function 함수명(...인수){}
// 2. (...인수) => {}
// 3. 인수[인덱스]
// ----------------------------
function calcSum(...prices){
    console.log(prices[0]); // 10, 5
    let result = 0;
    for(const value of prices)
        result += value;
    return result;
}
console.log(calcSum(10,20));    // 30
console.log(calcSum(5,10,20));  // 35
// ----------------------------
// ----------------------------
// ----------------------------
// ----------------------------
// ----------------------------
// ----------------------------
// ----------------------------


